uhnp/src/Documents/тн_РТиУ_С_ПредварительнымиНачислениями/тн_РТиУ_С_ПредварительнымиНачислениями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>тн_РТиУ_С_ПредварительнымиНачислениями</name>
  <comment>№000047250</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчетаОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеДополнительныхРеквизитов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрочиеРасходы</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>КорПодразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>КорНаправлениеДеятельности</name>
      <type>
        <types>CatalogRef.НаправленияДеятельности</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаБезНДС</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРегл</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУпр</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
    <attributes>
      <name>тн_ДелатьДопДвижениеПоСтраховомуФонду</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <type>
        <types>Characteristic.СтатьиРасходов</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяАктивовПассивов</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <type>
        <types>Characteristic.СтатьиАктивовПассивов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтражения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/InformationRegisters/тн_ДокументыЗагруженныеПоОбмену/тн_ДокументыЗагруженныеПоОбмену.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>тн_ДокументыЗагруженныеПоОбмену</name>
  <comment>// Юдина (Гутарова) Екатерина 04.09.2024 Выполнение задач №000050699</comment>
  <resources>
    <name>ДатаПоследнейЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <comment>// Егоров Петр 10.06.2025 Выполнение задач №000054028</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаДокумента</name>
    <comment>// Егоров Петр 10.06.2025 Выполнение задач №000054028</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИсходнаяОрганизация</name>
    <comment>// Егоров Петр 05.02.2026 Выполнение задач №000056658</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <attributes>
    <name>ИДСообщения</name>
    <comment>// Чекордина Ирина 10.12.2025 Выполнение задач №000056084</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Documents/тн_РТиУ_С_ПредварительнымиНачислениями/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Белоконенко Денис 23.10.2023 Выполнение задач №000047250
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Истина);
	Результат.Вставить("ОписаниеОшибки", "");
	
	ДополнительныеРеквизиты = ХранилищеДополнительныхРеквизитов.Получить();
	Если ДополнительныеРеквизиты.Свойство("ПропуститьПроверкуЗапретаИзменения") Тогда
		ДополнительныеРеквизиты.Удалить("ПропуститьПроверкуЗапретаИзменения");
	КонецЕсли;
	
	СтруктураДокументы = НайтиСвязанныеДокументы(Ссылка);	
	
	// 1. Реализация
	Если ЗначениеЗаполнено(СтруктураДокументы.Реализация) Тогда
		РеализацияОб = СтруктураДокументы.Реализация.ПолучитьОбъект();
	Иначе
				
		РеализацияСсылка = Документы.РеализацияТоваровУслуг.ПолучитьСсылку(Ссылка.УникальныйИдентификатор());
		
		РеализацияОб = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		РеализацияОб.УстановитьСсылкуНового(РеализацияСсылка);
	КонецЕсли;
	
	// Шапка      	
	ЗаполнитьЗначенияСвойств(РеализацияОб, ЭтотОбъект);
	Для Каждого ДопРеквизит Из ДополнительныеРеквизиты Цикл
		РеализацияОб.ДополнительныеСвойства.Вставить(ДопРеквизит.Ключ, ДопРеквизит.Значение);		
	КонецЦикла;
	РеализацияОб.тн_РТиУ_С_ПредварительнымиНачислениями = Ссылка;
	
	// ТЧ Товары
	РеализацияОб.Товары.Очистить();
	Для Каждого Стр Из ЭтотОбъект.Товары Цикл
		НоваяСтрока = РеализацияОб.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	Документы.РеализацияТоваровУслуг.ДозаполнитьОбъект(РеализацияОб, Отказ, Результат);
	
	РеализацияОб.Записать(РежимЗаписиДокумента.Проведение);       
	
	// НАЧАЛО Юдина (Гутарова) Екатерина 04.09.2024 Выполнение задач №000050699
	// НАЧАЛО Егоров Петр 10.06.2025 Выполнение задач №000054028
	//РегистрыСведений.тн_ДокументыЗагруженныеПоОбмену.ЗарегистрироватьДокументКакЗагруженный(РеализацияОб.Ссылка);   
	РегистрыСведений.тн_ДокументыЗагруженныеПоОбмену.ЗарегистрироватьДокументКакЗагруженный(Ссылка,Ссылка.Организация,Ссылка.Дата);
	// КОНЕЦ Егоров Петр 10.06.2025 Выполнение задач №000054028
	// КОНЕЦ Юдина (Гутарова) Екатерина 04.09.2024 Выполнение задач №000050699 
	
	// 2. Расход
	Если ЗначениеЗаполнено(СтруктураДокументы.Расход) Тогда
		РасходОб = СтруктураДокументы.Расход.ПолучитьОбъект();
	Иначе
				
		РасходСсылка = Документы.ПрочиеДоходыРасходы.ПолучитьСсылку(Ссылка.УникальныйИдентификатор());
		
		РасходОб = Документы.ПрочиеДоходыРасходы.СоздатьДокумент();
		РасходОб.УстановитьСсылкуНового(РасходСсылка);
	КонецЕсли;
	
	// Шапка      	
	ЗаполнитьЗначенияСвойств(РасходОб, ЭтотОбъект);
	Для Каждого ДопРеквизит Из ДополнительныеРеквизиты Цикл 
		Если ДопРеквизит.Ключ = "OperationType" Тогда
			Продолжить;
		ИначеЕсли ДопРеквизит.Ключ = "operationTypeOtherIncome" Тогда
			Ключ = "operationType";
		ИначеЕсли ДопРеквизит.Ключ = "recipientOrganizationINNOtherIncome" Тогда
			Ключ = "recipientOrganizationINN";
		ИначеЕсли ДопРеквизит.Ключ = "recipientOrganizationKPPOtherIncome" Тогда
			Ключ = "recipientOrganizationKPP";
		Иначе
			Ключ = ДопРеквизит.Ключ;
		КонецЕсли;
		
		РасходОб.ДополнительныеСвойства.Вставить(Ключ, ДопРеквизит.Значение);		
	КонецЦикла;
	РасходОб.тн_РТиУ_С_ПредварительнымиНачислениями = Ссылка;
	
	// ТЧ ПрочиеРасходы
	РасходОб.ПрочиеРасходы.Очистить();
	Для Каждого Стр Из ЭтотОбъект.ПрочиеРасходы Цикл
		НоваяСтрока = РасходОб.ПрочиеРасходы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	
	Документы.ПрочиеДоходыРасходы.ДозаполнитьОбъект(РасходОб, Отказ, Результат);
	
	РасходОб.Записать(РежимЗаписиДокумента.Проведение);
	
	// НАЧАЛО Юдина (Гутарова) Екатерина 04.09.2024 Выполнение задач №000050699
	// НАЧАЛО Егоров Петр 10.06.2025 Выполнение задач №000054028
	//РегистрыСведений.тн_ДокументыЗагруженныеПоОбмену.ЗарегистрироватьДокументКакЗагруженный(РасходОб.Ссылка);
	РегистрыСведений.тн_ДокументыЗагруженныеПоОбмену.ЗарегистрироватьДокументКакЗагруженный(Ссылка,Ссылка.Организация,Ссылка.Дата);
	// КОНЕЦ Егоров Петр 10.06.2025 Выполнение задач №000054028
	// КОНЕЦ Юдина (Гутарова) Екатерина 04.09.2024 Выполнение задач №000050699

КонецПроцедуры

// Белоконенко Денис 23.10.2023 Выполнение задач №000047250
Процедура ОбработкаУдаленияПроведения(Отказ)
	СтруктураДокументы = НайтиСвязанныеДокументы(Ссылка); 
			
	// 1. Реализация
	Если ЗначениеЗаполнено(СтруктураДокументы.Реализация) И СтруктураДокументы.Реализация.Проведен Тогда
		РеализацияОб = СтруктураДокументы.Реализация.ПолучитьОбъект();
		РеализацияОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);		
	КонецЕсли;
		 	
	// 2. Расход
	Если ЗначениеЗаполнено(СтруктураДокументы.Расход) И СтруктураДокументы.Расход.Проведен Тогда
		РасходОб = СтруктураДокументы.Расход.ПолучитьОбъект();
		РасходОб.Записать(РежимЗаписиДокумента.ОтменаПроведения);		
	КонецЕсли;
	
КонецПроцедуры

// Белоконенко Денис 23.10.2023 Выполнение задач №000047250
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураДокументы = НайтиСвязанныеДокументы(Ссылка);
	
	Если ЭтотОбъект.ПометкаУдаления Тогда
		// Установка пометки удаления	
		// 1. Реализация
		Если ЗначениеЗаполнено(СтруктураДокументы.Реализация) И Не СтруктураДокументы.Реализация.ПометкаУдаления Тогда
			РеализацияОб = СтруктураДокументы.Реализация.ПолучитьОбъект();
			РеализацияОб.УстановитьПометкуУдаления(Истина)
		КонецЕсли;
			 	
		// 2. Расход
		Если ЗначениеЗаполнено(СтруктураДокументы.Расход) И Не СтруктураДокументы.Расход.ПометкаУдаления Тогда
			РасходОб = СтруктураДокументы.Расход.ПолучитьОбъект();
			РасходОб.УстановитьПометкуУдаления(Истина);		
		КонецЕсли;
	Иначе 
		// Снятие пометки удаления
		// 1. Реализация
		Если ЗначениеЗаполнено(СтруктураДокументы.Реализация) И СтруктураДокументы.Реализация.ПометкаУдаления Тогда
			РеализацияОб = СтруктураДокументы.Реализация.ПолучитьОбъект();
			РеализацияОб.УстановитьПометкуУдаления(Ложь)
		КонецЕсли;
			 	
		// 2. Расход
		Если ЗначениеЗаполнено(СтруктураДокументы.Расход) И СтруктураДокументы.Расход.ПометкаУдаления Тогда
			РасходОб = СтруктураДокументы.Расход.ПолучитьОбъект();
			РасходОб.УстановитьПометкуУдаления(Ложь);		
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

// Белоконенко Денис 23.10.2023 Выполнение задач №000047250
Функция НайтиСвязанныеДокументы(РТиУ_С_ПредварительнымиНачислениями)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
		|	NULL КАК Расход
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|ГДЕ
		|	РеализацияТоваровУслуг.тн_РТиУ_С_ПредварительнымиНачислениями = &тн_РТиУ_С_ПредварительнымиНачислениями
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	NULL,
		|	ПрочиеДоходыРасходы.Ссылка
		|ИЗ
		|	Документ.ПрочиеДоходыРасходы КАК ПрочиеДоходыРасходы
		|ГДЕ
		|	ПрочиеДоходыРасходы.тн_РТиУ_С_ПредварительнымиНачислениями = &тн_РТиУ_С_ПредварительнымиНачислениями";
	
	Запрос.УстановитьПараметр("тн_РТиУ_С_ПредварительнымиНачислениями", РТиУ_С_ПредварительнымиНачислениями);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокументов = РезультатЗапроса.Выбрать();
	
	СтруктураДокументы = Новый Структура;
	СтруктураДокументы.Вставить("Реализация", Документы.РеализацияТоваровУслуг.ПустаяСсылка());
	СтруктураДокументы.Вставить("Расход", Документы.ПрочиеДоходыРасходы.ПустаяСсылка());
		
	Пока ВыборкаДокументов.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаДокументов.Реализация) Тогда
			СтруктураДокументы.Реализация = ВыборкаДокументов.Реализация;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ВыборкаДокументов.Расход) Тогда
			СтруктураДокументы.Расход = ВыборкаДокументов.Расход;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтруктураДокументы;
КонецФункции

#КонецЕсли
